## Sendy Logistics Challenge

#### Predict the estimated time of arrival (ETA) for motorbike deliveries in Nairobi

**Task**: Predict the time in seconds for Nairobian bike deliveries

**Approach**:

    - Linear Regression (quantitative response)
    - transit_time ~ orders + age + ?

In [1]:
import pandas as pd 
import numpy as np

In [2]:
riders = pd.read_csv("data/riders.csv")
sampsub = pd.read_csv("data/sample_submission.csv")
test = pd.read_csv("data/test.csv")

In [20]:
# rename cols-- easier to work with
riders.rename(columns= {
    "Rider Id": "id",
    "No_Of_Orders": "orders",
    "Age": "age",
    "Average_Rating": "average_rating",
    "No_of_Ratings": "number_rating" 
}, inplace=True)

# drop "Rider_Id_" in "id" column
riders.id.replace('Rider_Id_', ' ',regex=True,inplace=True)

       id  orders   age  average_rating  number_rating
0     396    2946  2298            14.0           1159
1     479     360   951            13.5            176
2     648    1746   821            14.3            466
3     753     314   980            12.5             75
4     335     536  1113            13.7            156
..    ...     ...   ...             ...            ...
955   896     152    99            12.4             18
956   149      69   101            10.2             10
957   270     338    96            14.4             41
958   201     159    96            15.0              9
959   904     172   108            13.7             18

[960 rows x 5 columns]

In [28]:
sampsub.rename(columns={
    "Order_No": "order",
    "Time from Pickup to Arrival": "transit_time"
}, inplace=True)

sampsub.order.replace("Order_No_", " ", regex=True, inplace=True)

In [29]:
sampsub

       order  transit_time
0      19248         567.0
1      12736        4903.0
2        768        5649.0
3      15332           NaN
4      21373           NaN
...      ...           ...
7063    3612           NaN
7064    7657           NaN
7065    1969           NaN
7066   10591           NaN
7067    1603           NaN

[7068 rows x 2 columns]